const chalk = require('chalk')
const fs = require('fs')

global.allmenu = (prefix, hituet) => {
return `
\`[ ʙ ᴏ ᴛ - ɪ ɴ ғ ᴏ ]\`
> 𖥔 ︳ᴄʀᴇᴀᴛᴏʀ : ${ownername}
> 𖥔 ︳ɴᴀᴍᴇ : ${botname}
> 𖥔 ︳ᴠᴇʀsɪ : 1.0.0

\`〣╴[ ᴍ ᴀ ɪ ɴ - ᴍ ᴇ ɴ ᴜ ] ╶〣\`

${global.ownermenu(prefix)}

${global.panelmenu(prefix)}

${global.groupmenu(prefix)}

${global.storemenu(prefix)}

${global.aimenu(prefix)}

${global.aieditmenu(prefix)}

${global.downloadmenu(prefix)}

${global.stickermenu(prefix)}

${global.makermenu(prefix)}

${global.rpgmenu(prefix)}

${global.gamemenu(prefix)}

${global.islamicmenu(prefix)}

${global.genshinmenu(prefix)}

${global.animemenu(prefix)}

${global.nsfwmenu(prefix)}

${global.ephotomenu(prefix)}

${global.encmenu(prefix)}

${global.convertmenu(prefix)}

${global.searchmenu(prefix)}

${global.anonymousmenu(prefix)}

${global.toolsmenu(prefix)}

${global.funmenu(prefix)}

${global.quotesmenu(prefix)}

${global.othermenu(prefix)}

${global.primbonmenu(prefix)}

${global.stalkmenu(prefix)}

${global.randommenu(prefix)}

*Note:* Gunakan bot dengan bijak.
`
}

global.panelmenu = (prefix) => {
return `┏━━━『 *ᴄ ʀ ᴇ ᴀ ᴛ ᴇ   ᴘ ᴀ ɴ ᴇ ʟ   ᴠ 1* 』
┃ ▧ ${prefix}1ɢʙ _ᴜsᴇʀ_
┃ ▧ ${prefix}2ɢʙ _ᴜsᴇʀ_
┃ ▧ ${prefix}3ɢʙ _ᴜsᴇʀ_
┃ ▧ ${prefix}4ɢʙ _ᴜsᴇʀ_
┃ ▧ ${prefix}5ɢʙ _ᴜsᴇʀ_
┃ ▧ ${prefix}6ɢʙ _ᴜsᴇʀ_
┃ ▧ ${prefix}7ɢʙ _ᴜsᴇʀ_
┃ ▧ ${prefix}8ɢʙ _ᴜsᴇʀ_
┃ ▧ ${prefix}ᴜɴʟɪ _ᴜsᴇʀ_
┗━━━━━━━━━━━━━━━━

┏━━━『 *ᴄ ʀ ᴇ ᴀ ᴛ ᴇ   ᴘ ᴀ ɴ ᴇ ʟ   ᴠ 2* 』
┃ ▧ ${prefix}1ɢʙᴠ2 _ᴜsᴇʀ_
┃ ▧ ${prefix}2ɢʙᴠ2 _ᴜsᴇʀ_
┃ ▧ ${prefix}3ɢʙᴠ2 _ᴜsᴇʀ_
┃ ▧ ${prefix}4ɢʙᴠ2 _ᴜsᴇʀ_
┃ ▧ ${prefix}5ɢʙᴠ2 _ᴜsᴇʀ_
┃ ▧ ${prefix}6ɢʙᴠ2 _ᴜsᴇʀ_
┃ ▧ ${prefix}7ɢʙᴠ2 _ᴜsᴇʀ_
┃ ▧ ${prefix}8ɢʙᴠ2 _ᴜsᴇʀ_
┃ ▧ ${prefix}ᴜɴʟɪᴠ2 _ᴜsᴇʀ_
┗━━━━━━━━━━━━━━━━

┏━━━『 *ᴍ ᴀ ɴ ᴀ ɢ ᴇ   s ᴇ ʀ ᴠ ᴇ ʀ* 』
┃ ▧ ${prefix}ʟɪsᴛᴘᴀɴᴇʟ
┃ ▧ ${prefix}ᴅᴇʟᴘᴀɴᴇʟ _ɪᴅ_
┃ ▧ ${prefix}ᴀᴅᴅsᴇʀᴠᴇʀ _ᴍᴀɴᴜᴀʟ_
┃ ▧ ${prefix}ᴄʟᴇᴀʀᴘᴀɴᴇʟ
┃ ▧ ${prefix}ʟɪsᴛᴘᴀɴᴇʟᴠ2
┃ ▧ ${prefix}ᴅᴇʟᴘᴀɴᴇʟᴠ2 _ɪᴅ_
┃ ▧ ${prefix}ᴄʟᴇᴀʀᴘᴀɴᴇʟᴠ2
┗━━━━━━━━━━━━━━━━

┏━━━『 *ᴀ ᴅ ᴍ ɪ ɴ   ᴘ ᴀ ɴ ᴇ ʟ* 』
┃ ▧ ${prefix}ᴄᴀᴅᴍɪɴ _ᴜsᴇʀ_
┃ ▧ ${prefix}ʟɪsᴛᴀᴅᴍɪɴ
┃ ▧ ${prefix}ᴅᴇʟᴀᴅᴍɪɴ _ɪᴅ_
┃ ▧ ${prefix}ᴄᴀᴅᴍɪɴᴠ2 _ᴜsᴇʀ_
┃ ▧ ${prefix}ʟɪsᴛᴀᴅᴍɪɴᴠ2
┃ ▧ ${prefix}ᴅᴇʟᴀᴅᴍɪɴᴠ2 _ɪᴅ_
┗━━━━━━━━━━━━━━━━

┏━━━『 *ʀ ᴇ s ᴇ ʟ ʟ ᴇ ʀ   s ʏ s ᴛ ᴇ ᴍ* 』
┃ ▧ ${prefix}ᴀᴅᴅɢʀᴜᴘʀᴇsᴇʟʟᴇʀ
┃ ▧ ${prefix}ᴅᴇʟɢʀᴜᴘʀᴇsᴇʟʟᴇʀ
┃ ▧ ${prefix}ʟɪsᴛɢʀᴜᴘʀᴇsᴇʟʟᴇʀ
┗━━━━━━━━━━━━━━━━`
}

global.primbonmenu = (prefix) => {
return `┏━━━『 *ᴘ ʀ ɪ ᴍ ʙ ᴏ ɴ ᴍ ᴇ ɴ ᴜ* 』
​┃ ▧ ${prefix}ғɪʀᴀsᴀᴛᴛᴇʟɪɴɢᴀ
┃ ▧ ${prefix}ғɪʀᴀsᴀᴛᴋᴇᴅᴜᴛᴀɴ
┃ ▧ ${prefix}ᴀʀᴛɪᴛᴀʜɪʟᴀʟᴀᴛ
┃ ▧ ${prefix}ᴋᴏᴋᴏʟᴏɢʏ
┃ ▧ ${prefix}ɢᴏᴍʙᴀʟᴀɴ
┃ ▧ ${prefix}ᴋᴀᴛᴀʙɪᴊᴀᴋ
┃ ▧ ${prefix}ғᴀᴋᴛᴀᴜɴɪᴋ
┃ ▧ ${prefix}ғᴀᴋᴛᴀᴘsɪᴋᴏʟᴏɢɪ
┃ ▧ ${prefix}ᴅᴇᴇᴘᴛᴀʟᴋ
┃ ▧ ${prefix}ᴀʟᴀsᴀɴɴɢᴇʟᴇs
┗━━━━━━━━━━━━━━━━`
}

global.stalkmenu = (prefix) => {
return `┏━━━『 *s ᴛ ᴀ ʟ ᴋ | ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ɪɢsᴛᴀʟᴋ
┃ ▧ ${prefix}ᴛᴛsᴛᴀʟᴋ
┃ ▧ ${prefix}ᴛᴡᴛsᴛᴀʟᴋ
┃ ▧ ${prefix}ɢʜsᴛᴀʟᴋ
┗━━━━━━━━━━━━━━━━`
}

global.randommenu = (prefix) => {
return `┏━━━『 *ʀ ᴀ ɴ ᴅ ᴏ ᴍ | ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ᴄᴇᴄᴀɴɪɴᴅᴏ
┃ ▧ ${prefix}ᴄᴇᴄᴀɴᴄʜɪɴᴀ
┃ ▧ ${prefix}ᴄᴇᴄᴀɴᴊᴀᴘᴀɴ
┃ ▧ ${prefix}ᴄᴇᴄᴀɴᴋᴏʀᴇᴀ
┃ ▧ ${prefix}ᴄᴇᴄᴀɴᴛʜᴀɪʟᴀɴᴅ
┃ ▧ ${prefix}ᴄᴇᴄᴀɴᴠɪᴇᴛɴᴀᴍᴇ
┃ ▧ ${prefix}ʀᴀɴᴅᴏᴍɴᴇᴋᴏ
┃ ▧ ${prefix}ʀᴀɴᴅᴏᴍʙʟᴜᴇᴀʀᴄʜɪᴠᴇ
┃ ▧ ${prefix}ʀᴀɴᴅᴏᴍᴡᴀɪғᴜ
┗━━━━━━━━━━━━━━━━`
}

global.ownermenu = (prefix) => {
return `┏━━━『 *ᴏ ᴡ ɴ ᴇ ʀ   ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ᴊᴏɪɴsᴇᴡᴀ
┃ ▧ ${prefix}sᴇᴡᴀʟɪɴᴋ
┃ ▧ ${prefix}ᴄᴇᴋsᴇᴡᴀ
┃ ▧ ${prefix}ᴀᴅᴅsᴇᴡᴀ
┃ ▧ ${prefix}ᴀᴅᴅᴄᴀsᴇ
┃ ▧ ${prefix}ᴅᴇʟᴄᴀsᴇ
┃ ▧ ${prefix}ɢᴇᴛᴄᴀsᴇ
┃ ▧ ${prefix}ᴜᴘᴅᴀᴛᴇᴄᴀsᴇ
┃ ▧ ${prefix}ʀᴇsᴛᴀʀᴛ
┃ ▧ ${prefix}ᴘɪɴᴄʜᴀᴛ
┃ ▧ ${prefix}ᴜɴᴘɪɴᴄʜᴀᴛ
┃ ▧ ${prefix}ᴄʟᴇᴀʀᴄʜᴀᴛ
┃ ▧ ${prefix}ᴘᴜʙʟɪᴄ
┃ ▧ ${prefix}sᴇʟғ
┃ ▧ ${prefix}ᴏɴʟʏᴀᴅᴍɪɴ
┃ ▧ ${prefix}ᴏɴʟʏɢᴄ
┃ ▧ ${prefix}ᴏɴʟʏᴘᴄ
┃ ▧ ${prefix}ᴀᴜᴛᴏʀᴇᴀᴅ
┃ ▧ ${prefix}ᴀᴅᴅᴘʀᴇᴍ
┃ ▧ ${prefix}ᴅᴇʟᴘʀᴇᴍ
┃ ▧ ${prefix}ʟɪsᴛᴘʀᴇᴍ
┃ ▧ ${prefix}ᴀᴅᴅᴏᴡɴᴇʀ
┃ ▧ ${prefix}ᴅᴇʟᴏᴡɴᴇʀ
┃ ▧ ${prefix}ʟɪsᴛᴏᴡɴᴇʀ
┃ ▧ ${prefix}ʀᴇsᴇᴛᴛʜᴜᴍʙ
┃ ▧ ${prefix}ᴄᴇᴋᴛʜᴜᴍʙ
┃ ▧ ${prefix}sᴇᴛᴛʜᴜᴍʙ
┃ ▧ ${prefix}sᴇᴛᴛʜᴜᴍʙᴠɪᴅ
┃ ▧ ${prefix}sᴇᴛᴍᴇɴᴜᴛʏᴘᴇ 1/2/3
┃ ▧ ${prefix}ᴜᴘsᴇᴛ
┃ ▧ ${prefix}ᴄʀᴇᴀᴛᴇɢᴄ
┃ ▧ ${prefix}sᴇᴛᴘᴘʙᴏᴛ
┃ ▧ ${prefix}sᴇᴛʙᴏᴛʙɪᴏ
┃ ▧ ${prefix}sᴇᴛʙᴏᴛɴᴀᴍᴇ
┃ ▧ ${prefix}ᴅᴇʟᴘᴘʙᴏᴛ
┃ ▧ ${prefix}sᴇᴛᴘᴘɢᴄ
┃ ▧ ${prefix}ᴅᴇʟᴘᴘɢᴄ
┃ ▧ ${prefix}sᴇᴛᴅᴇsᴄ
┃ ▧ ${prefix}sᴇᴛᴘʀᴇғɪx
┃ ▧ ${prefix}ɴᴘᴍ
┃ ▧ ${prefix}ʟᴇᴀᴠᴇɢᴄ
┃ ▧ ${prefix}ᴀᴅᴅᴄʜ
┃ ▧ ${prefix}ᴅᴇʟᴄʜ
┃ ▧ ${prefix}ʟɪsᴛᴄʜ
┃ ▧ ${prefix}ᴍᴜᴛᴇᴀʟʟ
┃ ▧ ${prefix}ᴀᴅᴅᴡʟ
┃ ▧ ${prefix}ᴅᴇʟᴡʟ
┃ ▧ ${prefix}ʟɪsᴛᴡʟ
┃ ▧ ${prefix}ᴀɴᴛɪsᴘᴀᴍ
┃ ▧ ${prefix}sᴇᴛᴄᴍᴅ
┃ ▧ ${prefix}ᴅᴇʟᴄᴍᴅ
┃ ▧ ${prefix}ʟɪsᴛᴄᴍᴅ
┃ ▧ ${prefix}ᴀᴜᴛᴏᴀᴅᴢᴀɴ
┃ ▧ ${prefix}ʟɪsᴛᴀᴅᴢᴀɴ
┃ ▧ ${prefix}ᴛᴏsᴡɢᴄ
┃ ▧ ${prefix}ᴄʜᴇᴄᴋᴜᴘᴅᴀᴛᴇ
┃ ▧ ${prefix}ᴜᴘᴅᴀᴛᴇsᴄ
┃ ▧ ${prefix}ᴀᴅᴅʟɪᴍɪᴛ
┃ ▧ ${prefix}ʀᴇsᴇᴛʟɪᴍɪᴛ
┃ ▧ ${prefix}ᴍᴏᴅᴇʟɪᴍɪᴛ
┃ ▧ ${prefix}ᴍᴏᴅᴇᴅᴀғᴛᴀʀ
┃ ▧ ${prefix}ʙᴀɴ
┃ ▧ ${prefix}ᴜɴʙᴀɴ
┃ ▧ ${prefix}sᴜʙᴜᴘᴅᴀᴛᴇ
┃ ▧ ${prefix}ᴜɴsᴜʙᴜᴘᴅᴀᴛᴇ
┃ ▧ ${prefix}ғᴏʀᴄᴇᴜᴘᴅᴀᴛᴇ
┃ ▧ ${prefix}ᴏᴡɴᴇʀ
┗━━━━━━━━━━━━━━━━`
}

global.groupmenu = (prefix) => {
return `┏━━━『 *ɢ ʀ ᴏ ᴜ ᴘ   ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ᴋɪᴄᴋ
┃ ▧ ${prefix}ᴋɪᴄᴋᴀʟʟ
┃ ▧ ${prefix}sᴇᴛᴘᴘɢᴄ
┃ ▧ ${prefix}ᴅᴇʟᴘᴘɢᴄ
┃ ▧ ${prefix}sᴇᴛɴᴀᴍᴇɢᴄ
┃ ▧ ${prefix}sᴇᴛᴅᴇsᴄ
┃ ▧ ${prefix}ᴄᴇᴋsᴇᴡᴀ
┃ ▧ ${prefix}ᴀᴅᴅsᴇᴡᴀ
┃ ▧ ${prefix}ʟᴇғᴛ
┃ ▧ ${prefix}sᴇᴛʟᴇғᴛ
┃ ▧ ${prefix}sᴇᴛᴡᴇʟᴄᴏᴍᴇ
┃ ▧ ${prefix}ᴡᴇʟᴄᴏᴍᴇ
┃ ▧ ${prefix}ʟɪsᴛᴡᴇʟᴄᴏᴍᴇ
┃ ▧ ${prefix}ᴄʟᴏsᴇᴛɪᴍᴇ
┃ ▧ ${prefix}ᴏᴘᴇɴᴛɪᴍᴇ
┃ ▧ ${prefix}ᴛᴀɢᴀʟʟ
┃ ▧ ${prefix}sɪᴅᴇʀ
┃ ▧ ${prefix}ᴅᴇᴍᴏᴛᴇ
┃ ▧ ${prefix}ᴘʀᴏᴍᴏᴛᴇ
┃ ▧ ${prefix}ᴅᴇʟᴇᴛᴇ
┃ ▧ ${prefix}ᴀᴅᴅ
┃ ▧ ${prefix}ʟɪɴᴋɢᴄ
┃ ▧ ${prefix}ᴀɴᴛɪʟɪɴᴋ
┃ ▧ ${prefix}ᴍᴜᴛᴇ
┃ ▧ ${prefix}ᴛᴀɢᴀᴅᴍɪɴ
┃ ▧ ${prefix}ᴛᴏᴛᴀʟᴀᴅᴍɪɴ
┃ ▧ ${prefix}ʜɪᴅᴇᴛᴀɢ
┃ ▧ ${prefix}ʟᴇᴀᴠᴇɢᴄ
┃ ▧ ${prefix}ʀᴇsᴇᴛʟɪɴᴋ
┃ ▧ ${prefix}ᴛᴏsᴡɢᴄ
┗━━━━━━━━━━━━━━━━`
}

global.storemenu = (prefix) => {
return `┏━━━『 *s ᴛ ᴏ ʀ ᴇ   ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ᴀᴅᴅʟɪsᴛ
┃ ▧ ${prefix}ᴅᴇʟʟɪsᴛ
┃ ▧ ${prefix}ʟɪsᴛ
┃ ▧ ${prefix}sᴇᴛsɪᴍʙᴏʟ
┃ ▧ ${prefix}sᴇᴛᴘʀᴏsᴇs
┃ ▧ ${prefix}ᴘʀᴏsᴇs
┃ ▧ ${prefix}sᴇᴛᴅᴏɴᴇ
┃ ▧ ${prefix}sᴇᴛᴅᴏɴᴇɪᴍᴀɢᴇ
┃ ▧ ${prefix}ᴅᴏɴᴇ
┃ ▧ ${prefix}sᴇᴛᴘᴇɴᴅɪɴɢ
┃ ▧ ${prefix}sᴇᴛᴘᴇɴᴅɪɴɢɪᴍᴀɢᴇ
┃ ▧ ${prefix}ᴘᴇɴᴅɪɴɢ
┃ ▧ ${prefix}sᴇᴛᴄᴀɴᴄᴇʟ
┃ ▧ ${prefix}sᴇᴛᴄᴀɴᴄᴇʟɪᴍᴀɢᴇ
┃ ▧ ${prefix}ᴄᴀɴᴄᴇʟ
┗━━━━━━━━━━━━━━━━`
}

global.aimenu = (prefix) => {
return `┏━━━『 *ᴀ ɪ   ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ᴀᴜᴛᴏᴀɪ
┃ ▧ ${prefix}ᴏᴘᴇɴᴀɪ
┃ ▧ ${prefix}ɢᴘᴛ4
┃ ▧ ${prefix}ɢᴇᴍɪɴɪ
┃ ▧ ${prefix}ᴄʟᴀᴜᴅᴇ
┗━━━━━━━━━━━━━━━━`
}

global.aieditmenu = (prefix) => {
return `┏━━━『 *ᴀ ɪ   ᴇ ᴅ ɪ ᴛ* 』
┃ ▧ ${prefix}ᴇᴅɪᴛ
┃ ▧ ${prefix}ᴘᴜᴛɪʜᴋᴀɴ
┃ ▧ ${prefix}ʜɪᴛᴀᴍᴋᴀɴ
┃ ▧ ${prefix}ᴛᴏʙᴇʀsᴀᴍᴀ
┃ ▧ ${prefix}ᴛᴏᴀɴɪᴍᴇ
┃ ▧ ${prefix}ᴛᴏɢʜɪʙʟɪ
┃ ▧ ${prefix}ᴛᴏᴄʜɪʙɪ
┃ ▧ ${prefix}ᴛᴏʜɪᴊᴀʙ
┃ ▧ ${prefix}ᴛᴏʙᴏᴛᴀᴋ
┃ ▧ ${prefix}ᴛᴏʙʀᴇᴡᴏᴋ
┃ ▧ ${prefix}ᴛᴏʙʟᴏɴᴅᴇ
┃ ▧ ${prefix}ᴛᴏᴊᴇᴘᴀɴɢ
┃ ▧ ${prefix}ᴛᴏᴍᴇᴋᴀʜ
┃ ▧ ${prefix}ᴛᴏᴅᴜʙᴀɪ
┃ ▧ ${prefix}ᴛᴏᴅᴘʀ
┃ ▧ ${prefix}ᴛᴏʟᴇɢᴏ
┃ ▧ ${prefix}ᴛᴏᴋᴀᴍʙᴏᴊᴀ
┃ ▧ ${prefix}ᴛᴏᴋᴀᴄᴀᴍᴀᴛᴀ
┃ ▧ ${prefix}ᴛᴏᴍɪʀʀᴏʀ
┃ ▧ ${prefix}ᴛᴏᴠɪɴᴛᴀɢᴇ
┃ ▧ ${prefix}ᴛᴏʀᴇᴀʟ
┃ ▧ ${prefix}ᴛᴏᴍᴏᴀɪ
┃ ▧ ${prefix}ᴛᴏᴍᴀʏᴀ
┃ ▧ ${prefix}ᴛᴏsᴀᴅ
┃ ▧ ${prefix}ᴛᴏsᴀᴛᴀɴ
┃ ▧ ${prefix}ᴛᴏsᴅᴍᴛɪɴɢɢɪ
┃ ▧ ${prefix}ᴛᴏʙᴀʙɪ
┃ ▧ ${prefix}ᴛᴏᴛᴇʟᴀɴᴊᴀɴɢ
┃ ▧ ${prefix}ᴛᴏʙᴜɢɪʟ
┗━━━━━━━━━━━━━━━━`
}

global.downloadmenu = (prefix) => {
return `┏━━━『 *ᴅ ᴏ ᴡ ɴ ʟ ᴏ ᴀ ᴅ s* 』
┃ ▧ ${prefix}ᴛᴡɪᴛᴛᴇʀᴅʟ
┃ ▧ ${prefix}ᴛɪᴋᴛᴏᴋ
┃ ▧ ${prefix}ᴛɪᴋᴛᴏᴋᴀᴜᴅɪᴏ
┃ ▧ ${prefix}ʏᴛᴍᴘ4
┃ ▧ ${prefix}ʏᴛᴍᴘ3
┃ ▧ ${prefix}ᴘʟᴀʏ
┃ ▧ ${prefix}ɪɴsᴛᴀɢʀᴀᴍ
┃ ▧ ${prefix}ᴍᴇᴅɪᴀғɪʀᴇ
┃ ▧ ${prefix}ᴡᴇʙ2ᴢɪᴘ
┃ ▧ ${prefix}spotifydl
┃ ▧ ${prefix}ɢᴅʀɪᴠᴇ
┃ ▧ ${prefix}ғʙᴅʟ
┗━━━━━━━━━━━━━━━━`
}

global.stickermenu = (prefix) => {
return `┏━━━『 *s ᴛ ɪ ᴄ ᴋ ᴇ ʀ s* 』
┃ ▧ ${prefix}ǫᴄ
┃ ▧ ${prefix}ǫᴜᴏᴛᴇᴄʜᴀᴛ
┃ ▧ ${prefix}ʙʀᴀᴛ
┃ ▧ ${prefix}sᴍᴇᴍᴇ
┃ ▧ ${prefix}ʙʀᴀᴛᴠɪᴅ
┃ ▧ ${prefix}sᴛɪᴄᴋᴇʀ
┃ ▧ ${prefix}ᴄʀʏ
┃ ▧ ${prefix}ᴋɪʟʟ
┃ ▧ ${prefix}ʜᴜɢ
┃ ▧ ${prefix}ᴘᴀᴛ
┃ ▧ ${prefix}ʙɪᴛᴇ
┃ ▧ ${prefix}ʏᴇᴇᴛ
┃ ▧ ${prefix}ʙᴜʟʟʏ
┃ ▧ ${prefix}ʙᴏɴᴋ
┃ ▧ ${prefix}ᴘᴏᴋᴇ
┃ ▧ ${prefix}ɴᴏᴍ
┃ ▧ ${prefix}sʟᴀᴘ
┃ ▧ ${prefix}sᴍɪʟᴇ
┃ ▧ ${prefix}ᴡᴀᴠᴇ
┃ ▧ ${prefix}ᴀᴡᴏᴏ
┃ ▧ ${prefix}ʙʟᴜsʜ
┃ ▧ ${prefix}sᴍᴜɢ
┃ ▧ ${prefix}ɢʟᴏᴍᴘ
┃ ▧ ${prefix}ʜᴀᴘᴘʏ
┃ ▧ ${prefix}ᴅᴀɴᴄᴇ
┃ ▧ ${prefix}ᴄʀɪɴɢᴇ
┃ ▧ ${prefix}ᴄᴜᴅᴅʟᴇ
┃ ▧ ${prefix}ʜɪɢʜғɪᴠᴇ
┃ ▧ ${prefix}sʜɪɴᴏʙᴜ
┃ ▧ ${prefix}ʜᴀɴᴅʜᴏʟᴅ
┃ ▧ ${prefix}ᴡᴏᴏғ
┃ ▧ ${prefix}8ʙᴀʟʟ
┃ ▧ ${prefix}ɢᴏᴏsᴇ
┃ ▧ ${prefix}ɢᴇᴄɢ
┃ ▧ ${prefix}ғᴇᴇᴅ
┃ ▧ ${prefix}ᴀᴠᴀᴛᴀʀ
┃ ▧ ${prefix}ғᴏx_ɢɪʀʟ
┃ ▧ ${prefix}ʟɪᴢᴀʀᴅ
┃ ▧ ${prefix}sᴘᴀɴᴋ1
┃ ▧ ${prefix}ᴍᴇᴏᴡ
┃ ▧ ${prefix}ᴛɪᴄᴋʟᴇ
┗━━━━━━━━━━━━━━━━`
}

global.makermenu = (prefix) => {
return `┏━━━『 *ᴍ ᴀ ᴋ ᴇ ʀ   ᴛ ᴏ ᴏ ʟ s* 』
┃ ▧ ${prefix}ᴀɴɪᴍᴇɢɪʀʟ
┃ ▧ ${prefix}ᴄᴀʀʙᴏɴɪғʏ
┃ ▧ ${prefix}ғᴀᴋᴇᴄᴀʟʟ
┃ ▧ ${prefix}ʙʀᴀᴛ
┃ ▧ ${prefix}ɴɢʟ
┃ ▧ ${prefix}ᴛᴏɢᴜʀᴀ
┃ ▧ ${prefix}ғᴀᴋᴇᴍʟ
┃ ▧ ${prefix}ɢᴜʀᴀ
┃ ▧ ${prefix}ᴛxᴛᴛᴏɪᴍɢ
┃ ▧ ${prefix}ғᴀᴋᴇsᴛᴏʀʏ
┃ ▧ ${prefix}ᴄᴀʀʙᴏɴᴄᴏᴅᴇɪᴍᴀɢᴇ
┃ ▧ ${prefix}ᴛᴇxᴛᴏɴɪᴍᴀɢᴇ
┃ ▧ ${prefix}ʙʀᴀᴛғᴏᴛᴏ
┃ ▧ ${prefix}ᴘᴀᴋᴜsᴛᴀᴅ
┃ ▧ ${prefix}ᴘᴀᴋᴜsᴛᴀᴅ2
┃ ▧ ${prefix}ᴀᴛᴛᴘ
┗━━━━━━━━━━━━━━━━`
}

global.rpgmenu = (prefix) => {
return `┏━━━『 *ʀ ᴘ ɢ   ɢ ᴀ ᴍ ᴇ s* 』
┃ ▧ ${prefix}ʟᴇᴀᴅᴇʀʙᴏᴀʀᴅ
┃ ▧ ${prefix}ᴍᴇ
┃ ▧ ${prefix}ɪɴᴠᴇɴᴛᴏʀʏ
┃ ▧ ${prefix}ᴋᴏʙᴏʏ
┃ ▧ ${prefix}ᴄʜᴇᴀᴛ
┃ ▧ ${prefix}ᴋᴏʟᴀᴍ
┃ ▧ ${prefix}ᴘᴇᴛsʜᴏᴘ
┃ ▧ ${prefix}ʀᴇғᴇʀᴀʟ
┃ ▧ ${prefix}ʀᴏʙ
┃ ▧ ${prefix}sʜᴏᴘ
┃ ▧ ${prefix}sᴇʟʟ
┃ ▧ ${prefix}ᴛʀᴀɴsғᴇʀ
┃ ▧ ${prefix}ɢᴀᴊɪᴀɴ
┃ ▧ ${prefix}ᴜᴘɢʀᴀᴅᴇ
┃ ▧ ${prefix}ғɪɢʜᴛ
┃ ▧ ${prefix}ғᴇᴇᴅ
┃ ▧ ${prefix}ʀᴇᴘᴀɪʀ
┃ ▧ ${prefix}ᴍᴀɴᴄɪɴɢ
┃ ▧ ${prefix}ᴄᴏʟʟᴇᴄᴛ
┃ ▧ ${prefix}ʙᴜɴᴜʜ
┃ ▧ ${prefix}ʜɪᴛᴍᴀɴ
┃ ▧ ${prefix}ʀᴀᴍᴘᴏᴋ
┃ ▧ ${prefix}ʙᴇʀᴅᴀɢᴀɴɢ
┃ ▧ ${prefix}ᴘᴏʟɪsɪ
┃ ▧ ${prefix}ʙᴇʀʙᴜʀᴜ
┃ ▧ ${prefix}ᴍᴜʟᴜɴɢ
┃ ▧ ${prefix}ᴛᴀxʏ
┃ ▧ ${prefix}ʙᴀɴsᴏs
┃ ▧ ${prefix}ʙᴇᴋᴇʀᴊᴀ
┃ ▧ ${prefix}ɴᴇʙᴀɴɢ
┃ ▧ ${prefix}ʙᴏɴᴜs
┃ ▧ ${prefix}ʙᴇᴛ
┃ ▧ ${prefix}ᴄʀᴀғᴛɪɴɢ
┃ ▧ ${prefix}ʙᴇʀᴋᴇʙᴏɴ
┃ ▧ ${prefix}ʙᴀɴᴋᴛᴀʀɪᴋ
┃ ▧ ${prefix}ʙᴀɴᴋɴᴀʙᴜɴɢ
┃ ▧ ${prefix}ʙᴀɴᴋᴄᴇᴋ
┃ ▧ ${prefix}ᴍᴀʟɪɴɢ
┃ ▧ ${prefix}ᴍɪɴɪɴɢ
┃ ▧ ${prefix}ʀᴏᴋᴇᴛ
┃ ▧ ${prefix}ғɪɢʜᴛɪɴɢ
┃ ▧ ${prefix}ғɪɢʜᴛᴄᴇɴᴛᴀᴜʀ
┃ ▧ ${prefix}ғɪɢʜᴛᴋʏᴜʙɪ
┃ ▧ ${prefix}ғɪɢʜᴛɢʀɪғғɪɴ
┃ ▧ ${prefix}ғɪɢʜᴛᴘʜᴏɴɪx
┃ ▧ ${prefix}ғɪɢʜᴛᴋᴜᴄɪɴɢ
┃ ▧ ${prefix}ғɪɢʜᴛɴᴀɢᴀ
┃ ▧ ${prefix}ᴋᴇʀᴊᴀ
┃ ▧ ${prefix}ʜᴇᴀʟ
┃ ▧ ${prefix}ᴄʀᴇᴀᴛᴇᴄʟᴀɴ
┃ ▧ ${prefix}ᴊᴏɪɴᴄʟᴀɴ
┃ ▧ ${prefix}ɪɴғᴏᴄʟᴀɴ
┃ ▧ ${prefix}ʟᴇᴀᴠᴇᴄʟᴀɴ
┃ ▧ ${prefix}ᴅᴇᴘᴏsɪᴛᴄʟᴀɴ
┃ ▧ ${prefix}ᴄʟᴀɴᴅᴀɪʟʏ
┃ ▧ ${prefix}ᴄʟᴀɴǫᴜᴇsᴛ
┃ ▧ ${prefix}ᴄʟᴀɴᴡᴀʀ
┃ ▧ ${prefix}ʟɪsᴛᴄʟᴀɴ
┃ ▧ ${prefix}ᴄʟᴀɴᴘʀᴏᴍᴏᴛᴇ
┃ ▧ ${prefix}ᴄʟᴀɴᴅᴇᴍᴏᴛᴇ
┃ ▧ ${prefix}ᴄʟᴀɴᴋɪᴄᴋ
┃ ▧ ${prefix}ᴄʟᴀɴʀᴇɴᴀᴍᴇ
┃ ▧ ${prefix}ᴄʟᴀɴᴅɪsʙᴀɴᴅ
┃ ▧ ${prefix}ᴄʟᴀɴᴅᴇᴘᴏsɪᴛ
┃ ▧ ${prefix}ᴄʟᴀɴᴡɪᴛʜᴅʀᴀᴡ
┃ ▧ ${prefix}ᴄʟᴀɴɪɴᴠɪᴛᴇ
┃ ▧ ${prefix}ʀᴀɪᴅʙᴏss
┃ ▧ ${prefix}ᴅᴇғᴇɴᴅ
┃ ▧ ${prefix}ᴄʟᴀɪᴍᴀɪʀᴅʀᴏᴘ
┃ ▧ ${prefix}ᴀɪʀᴅʀᴏᴘ
┗━━━━━━━━━━━━━━━━`
}

global.gamemenu = (prefix) => {
return `┏━━━『 *ғ ᴜ ɴ   ɢ ᴀ ᴍ ᴇ s* 』
┃ ▧ ${prefix}ɢᴇʟᴜᴅ
┃ ▧ ${prefix}ᴅᴜᴇʟ
┃ ▧ ${prefix}ᴛᴇʙᴀᴋʙᴏᴍ
┃ ▧ ${prefix}ᴛᴇʙᴀᴋᴋᴀᴛᴀ
┃ ▧ ${prefix}ᴛɪᴄᴛᴀᴄᴛᴏᴇ
┃ ▧ ${prefix}ᴅᴇʟᴛᴛᴛ
┃ ▧ ${prefix}ᴊᴏɪɴᴛᴛᴛ
┃ ▧ ${prefix}sᴜɪᴛᴘᴠᴘ
┃ ▧ ${prefix}ᴛᴇʙᴀᴋᴊᴋᴛ48
┃ ▧ ${prefix}ᴄᴀᴋʟᴏɴᴛᴏɴɢ
┃ ▧ ${prefix}ᴛᴇʙᴀᴋʙᴇɴᴅᴇʀᴀ
┃ ▧ ${prefix}ᴛᴇᴋᴀᴛᴇᴋɪ
┃ ▧ ${prefix}sᴜsᴜɴᴋᴀᴛᴀ
┃ ▧ ${prefix}sɪᴀᴘᴀᴀᴋᴜ
┃ ▧ ${prefix}ᴛᴇʙᴀᴋᴋɪᴍɪᴀ
┃ ▧ ${prefix}ᴛᴇʙᴀᴋɢᴀᴍʙᴀʀ
┃ ▧ ${prefix}ᴛᴇʙᴀᴋʟɪʀɪᴋ
┃ ▧ ${prefix}ᴛᴇʙᴀᴋᴛᴇʙᴀᴋᴀɴ
┃ ▧ ${prefix}ᴍᴇɴʏᴇʀᴀʜ
┃ ▧ ${prefix}ʙᴀɴᴛᴜᴀɴ
┃ ▧ ${prefix}ᴛᴇʙᴀᴋғғ
┃ ▧ ${prefix}ᴛᴇʙᴀᴋɢᴀᴍᴇ
┗━━━━━━━━━━━━━━━━`
}

global.islamicmenu = (prefix) => {
return `┏━━━『 *ɪ s ʟ ᴀ ᴍ ɪ ᴄ* 』
┃ ▧ ${prefix}ᴊᴀᴅᴡᴀʟsʜᴏʟᴀᴛ
┃ ▧ ${prefix}ᴀsᴍᴀᴜʟʜᴜsɴᴀ
┃ ▧ ${prefix}ɴɪᴀᴛsʜᴏʟᴀᴛ
┃ ▧ ${prefix}ᴅᴏᴀ
┃ ▧ ${prefix}ɢɪsʟᴀᴍ
┃ ▧ ${prefix}ᴋᴀᴛᴀɪsʟᴀᴍ
┃ ▧ ${prefix}ᴘᴀɴᴛᴜɴɪsʟᴀᴍ
┃ ▧ ${prefix}ᴊᴜᴢ
┃ ▧ ${prefix}ʟɪsᴛsᴜʀᴀʜ
┃ ▧ ${prefix}sᴜʀᴀʜ
┃ ▧ ${prefix}ᴀᴜᴛᴏᴀᴅᴢᴀɴ
┃ ▧ ${prefix}ʟɪsᴛᴀᴅᴢᴀɴ
┗━━━━━━━━━━━━━━━━`
}

global.genshinmenu = (prefix) => {
return `┏━━━『 *ɢ ᴇ ɴ s ʜ ɪ ɴ   ɪ ᴍ ᴘ ᴀ ᴄ ᴛ* 』
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴄʜᴀʀ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴀʀᴛɪғᴀᴄᴛ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴡᴇᴀᴘᴏɴs
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ғᴏᴏᴅ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴛᴀʟᴇɴᴛs
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴇɴᴇᴍʏ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴅᴏᴍᴀɪɴ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴍᴀᴛᴇʀɪᴀʟs
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴀᴄʜɪᴇᴠᴇᴍᴇɴᴛ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴡɪʟᴅʟɪғᴇ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴠᴏɪᴄᴇᴏᴠᴇʀs
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴠɪᴇᴡᴘᴏɪɴᴛ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴘᴏᴛɪᴏɴ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴏᴜᴛғɪᴛ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ɴᴀᴛɪᴏɴ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ɴᴀᴍᴀᴄᴀʀᴅ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴇᴍᴏᴊɪ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴄʀᴀғᴛ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴄᴏɴsᴛ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴀʀᴇᴀ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴀɴɪᴍᴀʟ
┃ ▧ ${prefix}ɢᴇɴsʜɪɴ-ᴀᴅᴠʀᴀɴᴋ
┗━━━━━━━━━━━━━━━━`
}

global.animemenu = (prefix) => {
return `┏━━━『 *ᴀ ɴ ɪ ᴍ ᴇ   ʟ ɪ s ᴛ* 』
┃ ▧ ${prefix}ᴀᴋɪʀᴀ
┃ ▧ ${prefix}ᴀᴋɪʏᴀᴍᴀ
┃ ▧ ${prefix}ᴀʀᴛ
┃ ▧ ${prefix}ᴀsᴜɴᴀ
┃ ▧ ${prefix}ᴀʏᴜᴢᴀᴡᴀ
┃ ▧ ${prefix}ʙᴏʀᴜᴛᴏ
┃ ▧ ${prefix}ʙᴛs
┃ ▧ ${prefix}ᴄʜɪʜᴏ
┃ ▧ ${prefix}ᴄʜɪᴛᴏɢᴇ
┃ ▧ ${prefix}ᴄᴏsᴘʟᴀʏ
┃ ▧ ${prefix}ᴄᴏsᴘʟᴀʏʟᴏʟɪ
┃ ▧ ${prefix}ᴄᴏsᴘʟᴀʏsᴀɢɪʀɪ
┃ ▧ ${prefix}ᴄʏʙᴇʀ
┃ ▧ ${prefix}ᴅᴇɪᴅᴀʀᴀ
┃ ▧ ${prefix}ᴅᴏʀᴀᴇᴍᴏɴ
┃ ▧ ${prefix}ᴇʟᴀɪɴᴀ
┃ ▧ ${prefix}ᴇᴍɪʟɪᴀ
┃ ▧ ${prefix}ᴇʀᴢᴀ
┃ ▧ ${prefix}ᴇxᴏ
┃ ▧ ${prefix}ɢᴀᴍᴇᴡᴀʟʟᴘᴀᴘᴇʀ
┃ ▧ ${prefix}ɢʀᴇᴍᴏʀʏ
┃ ▧ ${prefix}ʜᴀᴄᴋᴇʀ
┃ ▧ ${prefix}ʜᴇsᴛɪᴀ
┃ ▧ ${prefix}ʜɪɴᴀᴛᴀ
┃ ▧ ${prefix}ʜᴜsʙᴜ
┃ ▧ ${prefix}ɪɴᴏʀɪ
┃ ▧ ${prefix}ɪsʟᴀᴍɪᴄ
┃ ▧ ${prefix}ɪsᴜᴢᴜ
┃ ▧ ${prefix}ɪᴛᴀᴄʜɪ
┃ ▧ ${prefix}ɪᴛᴏʀɪ
┃ ▧ ${prefix}ᴊᴇɴɴɪᴇ
┃ ▧ ${prefix}ᴊɪsᴏ
┃ ▧ ${prefix}ᴊᴜsᴛɪɴᴀ
┃ ▧ ${prefix}ɢsɢᴀ
┃ ▧ ${prefix}ᴋᴀɢᴜʀᴀ
┃ ▧ ${prefix}ᴋᴀᴋᴀsɪʜ
┃ ▧ ${prefix}ᴋᴀᴏʀɪ
┃ ▧ ${prefix}ᴄᴀʀᴛᴏᴏɴ
┃ ▧ ${prefix}sʜᴏʀᴛǫᴜᴏᴛᴇ
┃ ▧ ${prefix}ᴋᴇɴᴇᴋɪ
┃ ▧ ${prefix}ᴋᴏᴛᴏʀɪ
┃ ▧ ${prefix}ᴋᴜʀᴜᴍɪ
┃ ▧ ${prefix}ʟɪsᴀ
┃ ▧ ${prefix}ᴍᴀᴅᴀʀᴀ
┃ ▧ ${prefix}ᴍᴇɢᴜᴍɪɴ
┃ ▧ ${prefix}ᴍɪᴋᴀsᴀ
┃ ▧ ${prefix}ᴍɪᴋᴇʏ
┃ ▧ ${prefix}ᴍɪᴋᴜ
┃ ▧ ${prefix}ᴍɪɴᴀᴛᴏ
┃ ▧ ${prefix}ᴍᴏᴜɴᴛᴀɪɴ
┃ ▧ ${prefix}ɴᴀʀᴜᴛᴏ
┃ ▧ ${prefix}ɴᴇᴋᴏ2
┃ ▧ ${prefix}ɴᴇᴋᴏɴɪᴍᴇ
┃ ▧ ${prefix}ɴᴇᴢᴜᴋᴏ
┃ ▧ ${prefix}ᴏɴᴇᴘɪᴇᴄᴇ
┃ ▧ ${prefix}ᴘᴇɴᴛᴏʟ
┃ ▧ ${prefix}ᴘᴏᴋᴇᴍᴏɴ
┃ ▧ ${prefix}ᴘʀᴏɢʀᴀᴍᴍɪɴɢ
┃ ▧ ${prefix}ʀᴀɴᴅᴏᴍɴɪᴍᴇ
┃ ▧ ${prefix}ʀᴀɴᴅᴏᴍɴɪᴍᴇ2
┃ ▧ ${prefix}ʀɪᴢᴇ
┃ ▧ ${prefix}ʀᴏsᴇ
┃ ▧ ${prefix}sᴀɢɪʀɪ
┃ ▧ ${prefix}sᴀᴋᴜʀᴀ
┃ ▧ ${prefix}sᴀsᴜᴋᴇ
┃ ▧ ${prefix}sᴀᴛᴀɴɪᴄ
┃ ▧ ${prefix}sʜɪɴᴀ
┃ ▧ ${prefix}sʜɪɴᴋᴀ
┃ ▧ ${prefix}sʜɪɴᴏᴍɪʏᴀ
┃ ▧ ${prefix}sʜɪᴢᴜᴋᴀ
┃ ▧ ${prefix}sʜᴏᴛᴀ
┃ ▧ ${prefix}sᴘᴀᴄᴇ
┃ ▧ ${prefix}ᴛᴇᴄʜɴᴏʟᴏɢʏ
┃ ▧ ${prefix}ᴛᴇᴊɪɴᴀ
┃ ▧ ${prefix}ᴛᴏᴜᴋᴀᴄʜᴀɴ
┃ ▧ ${prefix}ᴛsᴜɴᴀᴅᴇ
┃ ▧ ${prefix}ʏᴏᴛsᴜʙᴀ
┃ ▧ ${prefix}ʏᴜᴋɪ
┃ ▧ ${prefix}ʏᴜʟɪʙᴏᴄɪʟ
┃ ▧ ${prefix}ʏᴜᴍᴇᴋᴏ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴀᴠᴀᴛᴀʀ
┃ ▧ ${prefix}ᴀɴɪᴍᴇғᴇᴇᴅ
┃ ▧ ${prefix}ᴀɴɪᴍᴇɢᴇᴄɢ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴛɪᴄᴋʟᴇ
┃ ▧ ${prefix}ᴀɴɪᴍᴇғᴏxɢɪʀʟ
┃ ▧ ${prefix}ᴀɴɪᴍᴇɴᴏᴍ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴡᴀɪғᴜ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴄᴜᴅᴅʟᴇ
┃ ▧ ${prefix}ᴀɴɪᴍᴇsʟᴀᴘ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴘᴀᴛ
┃ ▧ ${prefix}ᴀɴɪᴍᴇɴᴇᴋᴏ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʜᴜɢ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴋɪss
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴡʟᴘ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴄʀʏ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴋɪʟʟ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʟɪᴄᴋ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʙɪᴛᴇ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʏᴇᴇᴛ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʙᴜʟʟʏ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʙᴏɴᴋ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴡɪɴᴋ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴘᴏᴋᴇ
┃ ▧ ${prefix}ᴀɴɪᴍᴇsᴍɪʟᴇ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴡᴀᴠᴇ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴀᴡᴏᴏ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʙʟᴜsʜ
┃ ▧ ${prefix}ᴀɴɪᴍᴇsᴍᴜɢ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʟᴏᴍᴘ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʜᴀᴘᴘʏ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴅᴀɴᴄᴇ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴄʀɪɴɢᴇ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʜɪɢʜғɪᴠᴇ
┃ ▧ ${prefix}ᴀɴɪᴍᴇʜᴀɴᴅʜᴏʟᴅ
┃ ▧ ${prefix}ᴀɴɪᴍᴇsʜɪɴᴏʙᴜ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴍᴇɢᴜᴍɪɴ
┃ ▧ ${prefix}ᴀɴɪᴍᴇᴡᴏᴏ
┗━━━━━━━━━━━━━━━━`
}

global.nsfwmenu = (prefix) => {
return `┏━━━『 *ɴ s ғ ᴡ   1 8 +* 』
┃ ▧ ${prefix}ɢɪғs
┃ ▧ ${prefix}ғᴏᴏᴛ
┃ ▧ ${prefix}ɢɪғʜᴇɴᴛᴀɪ
┃ ▧ ${prefix}ɢɪғʙʟᴏᴡᴊᴏʙ
┃ ▧ ${prefix}ᴢᴇᴛᴛᴀɪ
┃ ▧ ${prefix}ʏᴜʀɪ
┃ ▧ ${prefix}ᴀss
┃ ▧ ${prefix}ᴀʜᴇɢᴀᴏ
┃ ▧ ${prefix}ʙᴅsᴍ
┃ ▧ ${prefix}ʙʟᴏᴡᴊᴏʙ
┃ ▧ ${prefix}ᴄᴜᴄᴋᴏʟᴅ
┃ ▧ ${prefix}ᴄᴜᴍ
┃ ▧ ${prefix}ᴇʙᴀ
┃ ▧ ${prefix}ᴇʀᴏ
┃ ▧ ${prefix}ғᴇᴍᴅᴏᴍ
┃ ▧ ${prefix}ғᴏᴏᴅ
┃ ▧ ${prefix}ɢᴀɴɢʙᴀɴɢ
┃ ▧ ${prefix}ɢʟᴀssᴇs
┃ ▧ ${prefix}ᴊᴀʜʏ
┃ ▧ ${prefix}ᴍᴀsᴛᴜʀʙᴀᴛɪᴏɴ
┃ ▧ ${prefix}ɴᴇᴋᴏ-ʜᴇɴᴛᴀɪ
┃ ▧ ${prefix}ɴᴇᴋᴏ-ʜᴇɴᴛᴀɪ2
┃ ▧ ${prefix}ɴsғᴡʟᴏʟɪ
┃ ▧ ${prefix}ᴏʀɢʏ
┃ ▧ ${prefix}ᴘᴀɴᴛɪᴇs
┃ ▧ ${prefix}ᴘᴜssʏ
┃ ▧ ${prefix}ᴛᴇɴᴛᴀᴄʟᴇs
┃ ▧ ${prefix}ᴛʜɪɢʜs
┃ ▧ ${prefix}ʜᴇɴᴛᴀɪ
┃ ▧ ${prefix}ᴍɪʟғ
┃ ▧ ${prefix}ɢᴀsᴍ
┃ ▧ ${prefix}ʜᴇɴᴛᴀɪ-ᴡᴀɪғᴜ
┃ ▧ ${prefix}ɴᴡᴀɪғᴜ
┃ ▧ ${prefix}ʜᴇɴᴛᴀɪ-ɴᴇᴋᴏ
┃ ▧ ${prefix}ʜɴᴇᴋᴏ
┃ ▧ ${prefix}ᴛʀᴀᴘ
┃ ▧ ${prefix}ʜᴇɴᴛᴀɪᴠɪᴅ
┃ ▧ ${prefix}ʜᴇɴᴛᴀɪᴠɪᴅᴇᴏ
┗━━━━━━━━━━━━━━━━`
}

global.ephotomenu = (prefix) => {
return `┏━━━『 *ᴇ ᴘ ʜ ᴏ ᴛ ᴏ   3 6 0* 』
┃ ▧ ${prefix}ɢʟɪᴛᴄʜᴛᴇxᴛ
┃ ▧ ${prefix}ᴡʀɪᴛᴇᴛᴇxᴛ
┃ ▧ ${prefix}ᴀᴅᴠᴀɴᴄᴇᴅɢʟᴏᴡ
┃ ▧ ${prefix}ᴛʏᴘᴏɢʀᴀᴘʜʏᴛᴇxᴛ
┃ ▧ ${prefix}ᴘɪxᴇʟɢʟɪᴛᴄʜ
┃ ▧ ${prefix}ɴᴇᴏɴɢʟɪᴛᴄʜ
┃ ▧ ${prefix}ғʟᴀɢᴛᴇxᴛ
┃ ▧ ${prefix}ғʟᴀɢ3ᴅᴛᴇxᴛ
┃ ▧ ${prefix}ᴅᴇʟᴇᴛɪɴɢᴛᴇxᴛ
┃ ▧ ${prefix}ʙʟᴀᴄᴋᴘɪɴᴋsᴛʏʟᴇ
┃ ▧ ${prefix}ɢʟᴏᴡɪɴɢᴛᴇxᴛ
┃ ▧ ${prefix}ᴜɴᴅᴇʀᴡᴀᴛᴇʀᴛᴇxᴛ
┃ ▧ ${prefix}ʟᴏɢᴏᴍᴀᴋᴇʀ
┃ ▧ ${prefix}ᴄᴀʀᴛᴏᴏɴsᴛʏʟᴇ
┃ ▧ ${prefix}ᴘᴀᴘᴇʀᴄᴜᴛsᴛʏʟᴇ
┃ ▧ ${prefix}ᴡᴀᴛᴇʀᴄᴏʟᴏʀᴛᴇxᴛ
┃ ▧ ${prefix}ᴇғғᴇᴄᴛᴄʟᴏᴜᴅs
┃ ▧ ${prefix}ʙʟᴀᴄᴋᴘɪɴᴋʟᴏɢᴏ
┃ ▧ ${prefix}ɢʀᴀᴅɪᴇɴᴛᴛᴇxᴛ
┃ ▧ ${prefix}sᴜᴍᴍᴇʀʙᴇᴀᴄʜ
┃ ▧ ${prefix}ʟᴜxᴜʀʏɢᴏʟᴅ
┃ ▧ ${prefix}ᴍᴜʟᴛɪᴄᴏʟᴏʀᴇᴅɴᴇᴏɴ
┃ ▧ ${prefix}sᴀɴᴅsᴜᴍᴍᴇʀ
┃ ▧ ${prefix}ɢᴀʟᴀxʏᴡᴀʟʟᴘᴀᴘᴇʀ
┃ ▧ ${prefix}1917sᴛʏʟᴇ
┃ ▧ ${prefix}ᴍᴀᴋɪɴɢɴᴇᴏɴ
┃ ▧ ${prefix}ʀᴏʏᴀʟᴛᴇxᴛ
┃ ▧ ${prefix}ғʀᴇᴇᴄʀᴇᴀᴛᴇ
┃ ▧ ${prefix}ɢᴀʟᴀxʏsᴛʏʟᴇ
┃ ▧ ${prefix}ʟɪɢʜᴛᴇғғᴇᴄᴛs
┗━━━━━━━━━━━━━━━━`
}

global.encmenu = (prefix) => {
return `┏━━━『 *ᴇ ɴ ᴄ ʀ ʏ ᴘ ᴛ ɪ ᴏ ɴ* 』
┃ ▧ ${prefix}ᴇɴᴄᴄᴜsᴛᴏᴍᴇ
┃ ▧ ${prefix}ᴇɴᴄᴀʀᴀʙ
┃ ▧ ${prefix}ᴇɴᴄᴄʜɪɴᴀ
┃ ▧ ${prefix}ᴇɴᴄɪɴᴠɪs
┃ ▧ ${prefix}ᴇɴᴄsɪᴜ
┃ ▧ ${prefix}ᴇɴᴄsᴛʀᴏɴɢ
┃ ▧ ${prefix}ᴇɴᴄᴜʟᴛʀᴀ
┗━━━━━━━━━━━━━━━━`
}

global.convertmenu = (prefix) => {
return `┏━━━『 *ᴄ ᴏ ɴ ᴠ ᴇ ʀ ᴛ ᴇ ʀ* 』
┃ ▧ ${prefix}ᴛᴏɪᴍɢ
┃ ▧ ${prefix}ᴛᴏᴀᴜᴅɪᴏ
┃ ▧ ${prefix}ᴛᴏᴠɴ
┃ ▧ ${prefix}ᴛᴏᴍᴘ4
┗━━━━━━━━━━━━━━━━`
}

global.searchmenu = (prefix) => {
return `┏━━━『 *s ᴇ ᴀ ʀ ᴄ ʜ | ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ʟɪʀɪᴋ
┃ ▧ ${prefix}ʏᴛs
┃ ▧ ${prefix}ᴘɪɴᴛᴇʀᴇsᴛ
┃ ▧ ${prefix}ᴛᴇʟᴇsᴛɪᴄᴋᴇʀ
┃ ▧ ${prefix}ᴋʙʙɪ
┃ ▧ ${prefix}ᴡɪᴋɪᴘᴇᴅɪᴀ
┃ ▧ ${prefix}spotifysearch
┗━━━━━━━━━━━━━━━━`
}

global.anonymousmenu = (prefix) => {
return `┏━━━『 *ᴀ ɴ ᴏ ɴ ʏ ᴍ ᴏ ᴜ s | ᴍᴇɴᴜ* 』
┃ ▧ ${prefix}ᴍᴇɴғᴇss
┃ ▧ ${prefix}ʙᴀʟᴀsᴍᴇɴғᴇss
┃ ▧ ${prefix}ᴀɴᴏɴʏᴍᴏᴜs
┃ ▧ ${prefix}sᴛᴏᴘ
┃ ▧ ${prefix}ɴᴇxᴛ
┗━━━━━━━━━━━━━━━━`
}

global.toolsmenu = (prefix) => {
return `┏━━━『 *ᴛ ᴏ ᴏ ʟ s | ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ᴛᴏᴜʀʟ
┃ ▧ ${prefix}ʜᴅ
┃ ▧ ${prefix}ʀᴇᴍɪɴɪ
┃ ▧ ${prefix}ʜᴅʀ
┃ ▧ ${prefix}ʜᴅᴠɪᴅ
┃ ▧ ${prefix}ssᴡᴇʙ
┃ ▧ ${prefix}ᴡᴇʙ2ᴢɪᴘ
┃ ▧ ${prefix}ʀᴇᴍᴏᴠᴇʙɢ
┃ ▧ ${prefix}ʀᴇᴀᴄᴛᴄʜ
┃ ▧ ${prefix}ᴋᴏᴅᴇᴘᴏs
┃ ▧ ${prefix}ɴᴇɢᴀʀᴀ
┃ ▧ ${prefix}sᴜʙᴅᴏғɪɴᴅ
┗━━━━━━━━━━━━━━━━`
}

global.funmenu = (prefix) => {
return `┏━━━『 *ғ ᴜ ɴ | ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ᴄʜᴇᴄᴋᴍᴇ
┃ ▧ ${prefix}ᴛᴛs
┃ ▧ ${prefix}ᴄᴇᴋᴋʜᴏᴅᴀᴍ
┃ ▧ ${prefix}ᴋᴀᴛᴀɪʟʜᴀᴍ
┃ ▧ ${prefix}ᴛʀᴜᴛʜ
┃ ▧ ${prefix}ᴅᴀʀᴇ
┃ ▧ ${prefix}ғᴀᴋᴛᴀᴜɴɪᴋ
┃ ▧ ${prefix}ᴘᴀɴᴛᴜɴ
┃ ▧ ${prefix}sʟᴏᴛ
┃ ▧ ${prefix}ᴄᴀsɪɴᴏ
┃ ▧ ${prefix}ᴄᴏɪɴғʟɪᴘ
┃ ▧ ${prefix}ᴅɪᴄᴇ
┃ ▧ ${prefix}ʀᴏᴜʟᴇᴛᴛᴇ
┃ ▧ ${prefix}ᴅᴜɴɢᴇᴏɴ
┃ ▧ ${prefix}ғᴀᴄᴇᴘᴀʟᴍ
┃ ▧ ${prefix}ᴄᴇᴋɢᴀʏ
┃ ▧ ${prefix}ʙᴇᴀᴜᴛɪғᴜʟ
┃ ▧ ${prefix}ʙʟᴜʀ
┃ ▧ ${prefix}sᴛᴇʀᴛɪғɪᴋᴀᴛᴛᴏʟᴏʟ
┃ ▧ ${prefix}ᴅᴜɴɢᴇᴏɴ
┗━━━━━━━━━━━━━━━━`
}

global.quotesmenu = (prefix) => {
return `┏━━━『 *ǫ ᴜ ᴏ ᴛ ᴇ s | ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ǫᴜᴏᴛᴇsᴀɴɪᴍᴇ
┃ ▧ ${prefix}ǫᴜᴏᴛᴇsʙᴀᴄᴏᴛ
┃ ▧ ${prefix}ǫᴜᴏᴛᴇsʙᴜᴄɪɴ
┃ ▧ ${prefix}ǫᴜᴏᴛᴇsᴍᴏᴛɪᴠᴀsɪ
┃ ▧ ${prefix}ǫᴜᴏᴛᴇsɢᴀʟᴀᴜ
┃ ▧ ${prefix}ǫᴜᴏᴛᴇsɢᴏᴍʙᴀʟ
┃ ▧ ${prefix}ǫᴜᴏᴛᴇsʜᴀᴄᴋᴇʀ
┃ ▧ ${prefix}ǫᴜᴏᴛᴇsʙɪᴊᴀᴋ
┃ ▧ ${prefix}ǫᴜᴏᴛᴇs
┗━━━━━━━━━━━━━━━━`
}

global.othermenu = (prefix) => {
return `┏━━━『 *ᴏ ᴛ ʜ ᴇ ʀ s | ᴍ ᴇ ɴ ᴜ* 』
┃ ▧ ${prefix}ᴘɪɴɢ
┃ ▧ ${prefix}ᴏs
┃ ▧ ${prefix}ᴄᴇᴋʀᴇsɪ
┃ ▧ ${prefix}ɴsғᴡᴄᴇᴋ
┃ ▧ ${prefix}ᴛᴇᴍᴘᴍᴀɪʟ
┃ ▧ ${prefix}ᴄʜᴇᴄᴋᴍᴀɪʟ
┃ ▧ ${prefix}ᴇᴍᴏᴊɪɢɪғ
┃ ▧ ${prefix}ᴅᴀғᴛᴀʀ
┃ ▧ ${prefix}ᴜɴʀᴇɢ
┃ ▧ ${prefix}ᴄᴇᴋsɴ
┃ ▧ ${prefix}ʟɪsᴛʙᴀɴ
┃ ▧ ${prefix}ᴄᴇᴋʟɪᴍɪᴛ
┃ ▧ ${prefix}ᴍᴏᴅᴇʟɪᴍɪᴛ
┃ ▧ ${prefix}ᴍᴏᴅᴇᴅᴀғᴛᴀʀ
┃ ▧ ${prefix}sᴄʀɪᴘᴛ
┃ ▧ ${prefix}sᴄ
┗━━━━━━━━━━━━━━━━`
}

let file = require.resolve(__filename)
fs.watchFile(file, () => {
	fs.unwatchFile(file)
	console.log(chalk.redBright(`Update ${__filename}`))
	delete require.cache[file]
	require(file)
})
